{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.5.2", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_5/kernel", "shape": [1, 1, 2, 8], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [8], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 8, 8], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [8], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [72, 50], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [50, 9], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [9], "dtype": "float32"}]}]}